Masmiseim36/nxpSDK/boards/sln_vizn3d_iot/sln_vision_examples/smart_lock/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFlexioCameraPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: N7, peripheral: LPI2C5, signal: SDA, pin_signal: GPIO_LPSR_04, identifier: '', software_input_on: Enable, open_drain: Enable, drive_strength: Normal}
  - {pin_num: N8, peripheral: LPI2C5, signal: SCL, pin_signal: GPIO_LPSR_05, identifier: '', software_input_on: Enable, pull_keeper_select: Keeper, open_drain: Enable,
    drive_strength: Normal}
  - {pin_num: L13, peripheral: FLEXIO2, signal: 'IO, 24', pin_signal: GPIO_AD_24, identifier: ''}
  - {pin_num: M15, peripheral: FLEXIO2, signal: 'IO, 25', pin_signal: GPIO_AD_25, identifier: ''}
  - {pin_num: L14, peripheral: FLEXIO2, signal: 'IO, 26', pin_signal: GPIO_AD_26, identifier: ''}
  - {pin_num: N16, peripheral: FLEXIO2, signal: 'IO, 27', pin_signal: GPIO_AD_27, identifier: ''}
  - {pin_num: L17, peripheral: FLEXIO2, signal: 'IO, 28', pin_signal: GPIO_AD_28, identifier: ''}
  - {pin_num: M17, peripheral: FLEXIO2, signal: 'IO, 29', pin_signal: GPIO_AD_29, identifier: ''}
  - {pin_num: K17, peripheral: FLEXIO2, signal: 'IO, 30', pin_signal: GPIO_AD_30}
  - {pin_num: J17, peripheral: FLEXIO2, signal: 'IO, 31', pin_signal: GPIO_AD_31, identifier: ''}
  - {pin_num: N12, peripheral: FLEXIO2, signal: 'IO, 00', pin_signal: GPIO_AD_00, identifier: MCLK}
  - {pin_num: R14, peripheral: FLEXIO2, signal: 'IO, 01', pin_signal: GPIO_AD_01, identifier: PIXCLK}
  - {pin_num: R13, peripheral: FLEXIO2, signal: 'IO, 02', pin_signal: GPIO_AD_02, identifier: HSYNC}
  - {pin_num:  peripheral: 9, signal: 'gpio_mux_io, 31', pin_signal: GPIO_AD_32, identifier: VSYNC}
  - {pin_num: F14, peripheral: GPIO10, signal: 'gpio_io, 13', pin_signal: GPIO_SD_B2_04, identifier: PWDN}
  - {pin_num: L2, peripheral: GPIO2, signal: 'gpio_mux_io, 25', pin_signal: GPIO_EMC_B2_15, identifier: RESET}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexioCameraPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlexioCameraPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_00_FLEXIO2_D00,          /* GPIO_AD_00 is configured as FLEXIO2_D00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_01_FLEXIO2_D01,          /* GPIO_AD_01 is configured as FLEXIO2_D01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_02_FLEXIO2_D02,          /* GPIO_AD_02 is configured as FLEXIO2_D02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_24_FLEXIO2_D24,          /* GPIO_AD_24 is configured as FLEXIO2_D24 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_25_FLEXIO2_D25,          /* GPIO_AD_25 is configured as FLEXIO2_D25 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_26_FLEXIO2_D26,          /* GPIO_AD_26 is configured as FLEXIO2_D26 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_27_FLEXIO2_D27,          /* GPIO_AD_27 is configured as FLEXIO2_D27 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_28_FLEXIO2_D28,          /* GPIO_AD_28 is configured as FLEXIO2_D28 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_29_FLEXIO2_D29,          /* GPIO_AD_29 is configured as FLEXIO2_D29 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_30_FLEXIO2_D30,          /* GPIO_AD_30 is configured as FLEXIO2_D30 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_31_FLEXIO2_D31,          /* GPIO_AD_31 is configured as FLEXIO2_D31 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_32_GPIO_MUX3_IO31,        /* GPIO_AD_32 is configured as GPIO_MUX3_IO31 */
      0U);                                     /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SD_B2_04_GPIO10_IO13,       /* GPIO_SD_B2_04 is configured as GPIO10_IO13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_15_GPIO_MUX2_IO25,     /* GPIO_SNVS_02 is configured as GPIO13_IO25 */
      0U);                                      /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR41 = ((IOMUXC_GPR->GPR41 &
    (~(IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH(0x00U) /* GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
    );
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_04_LPI2C5_SDA,         /* GPIO_LPSR_04 is configured as LPI2C5_SDA */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_04 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_05_LPI2C5_SCL,         /* GPIO_LPSR_05 is configured as LPI2C5_SCL */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_05 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_04_LPI2C5_SDA,         /* GPIO_LPSR_04 PAD functional properties : */
      0x20U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain LPSR Field: Enabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_05_LPI2C5_SCL,         /* GPIO_LPSR_05 PAD functional properties : */
      0x20U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain LPSR Field: Enabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}


