Masmiseim36/nxpSDK/boards/sln_vizn3d_iot/sln_vision_examples/smart_lock/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitElcdifRk024hh298LcdPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: E13, peripheral: LCDIF, signal: lcdif_clk, pin_signal: GPIO_DISP_B1_00, identifier: '', pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: D13, peripheral: LCDIF, signal: lcdif_enable, pin_signal: GPIO_DISP_B1_01, identifier: '', pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: D11, peripheral: LCDIF, signal: lcdif_hsync, pin_signal: GPIO_DISP_B1_02, identifier: '', pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: E11, peripheral: LCDIF, signal: lcdif_vsync, pin_signal: GPIO_DISP_B1_03, identifier: '', pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: E10, peripheral: LCDIF, signal: 'lcdif_data, 00', pin_signal: GPIO_DISP_B1_04, identifier: '', pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: C11, peripheral: LCDIF, signal: 'lcdif_data, 01', pin_signal: GPIO_DISP_B1_05, identifier: '', pull_down_pull_up_config: No_Pull, pdrv_config: Normal_Driver}
  - {pin_num: D10, peripheral: LCDIF, signal: 'lcdif_data, 02', pin_signal: GPIO_DISP_B1_06, identifier: '', pdrv_config: Normal_Driver}
  - {pin_num: E12, peripheral: LCDIF, signal: 'lcdif_data, 03', pin_signal: GPIO_DISP_B1_07, identifier: '', pdrv_config: Normal_Driver}
  - {pin_num: A15, peripheral: LCDIF, signal: 'lcdif_data, 04', pin_signal: GPIO_DISP_B1_08, identifier: '', pdrv_config: Normal_Driver}
  - {pin_num: C13, peripheral: LCDIF, signal: 'lcdif_data, 05', pin_signal: GPIO_DISP_B1_09, identifier: '', pdrv_config: Normal_Driver}
  - {pin_num: B14, peripheral: LCDIF, signal: 'lcdif_data, 06', pin_signal: GPIO_DISP_B1_10, identifier: '', pdrv_config: Normal_Driver}
  - {pin_num: A14, peripheral: LCDIF, signal: 'lcdif_data, 07', pin_signal: GPIO_DISP_B1_11, identifier: '', pdrv_config: Normal_Driver}
  - {pin_num: E8, peripheral: LCDIF, signal: 'lcdif_data, 08', pin_signal: GPIO_DISP_B2_00, pull_up_down_config: Pull_Up, pull_keeper_select: Pull, drive_strength: High}
  - {pin_num: F8, peripheral: LCDIF, signal: 'lcdif_data, 09', pin_signal: GPIO_DISP_B2_01, pull_up_down_config: Pull_Up, pull_keeper_select: Pull}
  - {pin_num: E9, peripheral: LCDIF, signal: 'lcdif_data, 10', pin_signal: GPIO_DISP_B2_02, identifier: '', pull_up_down_config: Pull_Up, pull_keeper_select: Pull,
    drive_strength: High}
  - {pin_num: D7, peripheral: LCDIF, signal: 'lcdif_data, 11', pin_signal: GPIO_DISP_B2_03, identifier: '', pull_up_down_config: Pull_Up, pull_keeper_select: Pull,
    drive_strength: High}
  - {pin_num: C7, peripheral: LCDIF, signal: 'lcdif_data, 12', pin_signal: GPIO_DISP_B2_04, identifier: '', pull_up_down_config: Pull_Up, pull_keeper_select: Pull,
    drive_strength: High}
  - {pin_num: C9, peripheral: LCDIF, signal: 'lcdif_data, 13', pin_signal: GPIO_DISP_B2_05, identifier: '', pull_up_down_config: Pull_Up, pull_keeper_select: Pull,
    drive_strength: High}
  - {pin_num: C6, peripheral: LCDIF, signal: 'lcdif_data, 14', pin_signal: GPIO_DISP_B2_06, identifier: '', pull_up_down_config: Pull_Up, pull_keeper_select: Pull,
    drive_strength: High}
  - {pin_num: D6, peripheral: LCDIF, signal: 'lcdif_data, 15', pin_signal: GPIO_DISP_B2_07, identifier: '', pull_up_down_config: Pull_Up, open_drain: Disable, drive_strength: High}
  - {pin_num: P13, peripheral: GPIO9, signal: 'gpio_io, 04', pin_signal: GPIO_AD_05}
  - {pin_num: N13, peripheral: GPIO9, signal: 'gpio_io, 05', pin_signal: GPIO_AD_06}
  - {pin_num: R2, peripheral: GPIO2, signal: 'gpio_mux_io, 20', pin_signal: GPIO_EMC_B2_10}
  - {pin_num: L4, peripheral: GPIO2, signal: 'gpio_mux_io, 21', pin_signal: GPIO_EMC_B2_11}
  - {pin_num: M2, peripheral: GPIO2, signal: 'gpio_mux_io, 22', pin_signal: GPIO_EMC_B2_12}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitElcdifRk024hh298LcdPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitElcdifRk024hh298LcdPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_05_GPIO9_IO04,           /* GPIO_AD_05 is configured as GPIO9_IO04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_06_GPIO9_IO05,           /* GPIO_AD_06 is configured as GPIO9_IO05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_00_VIDEO_MUX_LCDIF_CLK,  /* GPIO_DISP_B1_00 is configured as VIDEO_MUX_LCDIF_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_01_VIDEO_MUX_LCDIF_ENABLE,  /* GPIO_DISP_B1_01 is configured as VIDEO_MUX_LCDIF_ENABLE */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_02_VIDEO_MUX_LCDIF_HSYNC,  /* GPIO_DISP_B1_02 is configured as VIDEO_MUX_LCDIF_HSYNC */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_03_VIDEO_MUX_LCDIF_VSYNC,  /* GPIO_DISP_B1_03 is configured as VIDEO_MUX_LCDIF_VSYNC */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_04_VIDEO_MUX_LCDIF_DATA00,  /* GPIO_DISP_B1_04 is configured as VIDEO_MUX_LCDIF_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_05_VIDEO_MUX_LCDIF_DATA01,  /* GPIO_DISP_B1_05 is configured as VIDEO_MUX_LCDIF_DATA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_06_VIDEO_MUX_LCDIF_DATA02,  /* GPIO_DISP_B1_06 is configured as VIDEO_MUX_LCDIF_DATA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_07_VIDEO_MUX_LCDIF_DATA03,  /* GPIO_DISP_B1_07 is configured as VIDEO_MUX_LCDIF_DATA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_08_VIDEO_MUX_LCDIF_DATA04,  /* GPIO_DISP_B1_08 is configured as VIDEO_MUX_LCDIF_DATA04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_09_VIDEO_MUX_LCDIF_DATA05,  /* GPIO_DISP_B1_09 is configured as VIDEO_MUX_LCDIF_DATA05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_10_VIDEO_MUX_LCDIF_DATA06,  /* GPIO_DISP_B1_10 is configured as VIDEO_MUX_LCDIF_DATA06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B1_11_VIDEO_MUX_LCDIF_DATA07,  /* GPIO_DISP_B1_11 is configured as VIDEO_MUX_LCDIF_DATA07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_00_VIDEO_MUX_LCDIF_DATA08,  /* GPIO_DISP_B2_00 is configured as VIDEO_MUX_LCDIF_DATA08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_01_VIDEO_MUX_LCDIF_DATA09,  /* GPIO_DISP_B2_01 is configured as VIDEO_MUX_LCDIF_DATA09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_02_VIDEO_MUX_LCDIF_DATA10,  /* GPIO_DISP_B2_02 is configured as VIDEO_MUX_LCDIF_DATA10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_03_VIDEO_MUX_LCDIF_DATA11,  /* GPIO_DISP_B2_03 is configured as VIDEO_MUX_LCDIF_DATA11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_04_VIDEO_MUX_LCDIF_DATA12,  /* GPIO_DISP_B2_04 is configured as VIDEO_MUX_LCDIF_DATA12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_05_VIDEO_MUX_LCDIF_DATA13,  /* GPIO_DISP_B2_05 is configured as VIDEO_MUX_LCDIF_DATA13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_06_VIDEO_MUX_LCDIF_DATA14,  /* GPIO_DISP_B2_06 is configured as VIDEO_MUX_LCDIF_DATA14 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_07_VIDEO_MUX_LCDIF_DATA15,  /* GPIO_DISP_B2_07 is configured as VIDEO_MUX_LCDIF_DATA15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_10_GPIO_MUX2_IO20,   /* GPIO_EMC_B2_10 is configured as GPIO_MUX2_IO20 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_11_GPIO_MUX2_IO21,   /* GPIO_EMC_B2_11 is configured as GPIO_MUX2_IO21 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_12_GPIO_MUX2_IO22,   /* GPIO_EMC_B2_12 is configured as GPIO_MUX2_IO22 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR41 = ((IOMUXC_GPR->GPR41 &
    (~(IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH(0x00U) /* GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
    );
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_00_VIDEO_MUX_LCDIF_CLK,  /* GPIO_DISP_B1_00 PAD functional properties : */
      0x0EU);                                 /* PDRV Field: normal drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_01_VIDEO_MUX_LCDIF_ENABLE,  /* GPIO_DISP_B1_01 PAD functional properties : */
      0x0EU);                                 /* PDRV Field: normal drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_02_VIDEO_MUX_LCDIF_HSYNC,  /* GPIO_DISP_B1_02 PAD functional properties : */
      0x0EU);                                 /* PDRV Field: normal drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_03_VIDEO_MUX_LCDIF_VSYNC,  /* GPIO_DISP_B1_03 PAD functional properties : */
      0x0EU);                                 /* PDRV Field: normal drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_04_VIDEO_MUX_LCDIF_DATA00,  /* GPIO_DISP_B1_04 PAD functional properties : */
      0x0EU);                                 /* PDRV Field: normal drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_05_VIDEO_MUX_LCDIF_DATA01,  /* GPIO_DISP_B1_05 PAD functional properties : */
      0x0EU);                                 /* PDRV Field: normal drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_06_VIDEO_MUX_LCDIF_DATA02,  /* GPIO_DISP_B1_06 PAD functional properties : */
      0x0EU);                                 /* PDRV Field: normal drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_07_VIDEO_MUX_LCDIF_DATA03,  /* GPIO_DISP_B1_07 PAD functional properties : */
      0x0EU);                                 /* PDRV Field: normal drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_08_VIDEO_MUX_LCDIF_DATA04,  /* GPIO_DISP_B1_08 PAD functional properties : */
      0x0EU);                                 /* PDRV Field: normal drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_09_VIDEO_MUX_LCDIF_DATA05,  /* GPIO_DISP_B1_09 PAD functional properties : */
      0x0EU);                                 /* PDRV Field: normal drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_10_VIDEO_MUX_LCDIF_DATA06,  /* GPIO_DISP_B1_10 PAD functional properties : */
      0x0EU);                                 /* PDRV Field: normal drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B1_11_VIDEO_MUX_LCDIF_DATA07,  /* GPIO_DISP_B1_11 PAD functional properties : */
      0x0EU);                                 /* PDRV Field: normal drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
