Masmiseim36/nxpSDK/boards/sln_vizn3d_iot/sln_vision_examples/smart_lock/cm7/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCsi3DCameraPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: P8, peripheral: LPI2C6, signal: SDA, pin_signal: GPIO_LPSR_06, software_input_on: Enable, pull_up_down_config: Pull_Up, pull_keeper_select: Pull, open_drain: Enable}
  - {pin_num: R8, peripheral: LPI2C6, signal: SCL, pin_signal: GPIO_LPSR_07, software_input_on: Enable, pull_up_down_config: Pull_Up, pull_keeper_select: Pull, open_drain: Enable}
  - {pin_num: P1, peripheral: GPIO2, signal: 'gpio_mux_io, 18', pin_signal: GPIO_EMC_B2_08, identifier: BRIDGE_RESET, direction: OUTPUT, gpio_init_state: 'true',
    open_drain: Disable}
  - {pin_num: T9, peripheral: GPIO13, signal: 'gpio_io, 02', pin_signal: PMIC_STBY_REQ, identifier: VDD_1V2, direction: OUTPUT, gpio_init_state: 'true', software_input_on: Disable}
  - {pin_num: R11, peripheral: GPIO13, signal: 'gpio_io, 12', pin_signal: GPIO_SNVS_09, identifier: AP_LDP_INT, direction: OUTPUT}
  - {pin_num: M9, peripheral: GPIO13, signal: 'gpio_io, 09', pin_signal: GPIO_SNVS_06, direction: OUTPUT, gpio_init_state: 'true', software_input_on: Disable}
  - {pin_num: N9, peripheral: GPIO13, signal: 'gpio_io, 11', pin_signal: GPIO_SNVS_08, direction: OUTPUT, software_input_on: Disable}
  - {pin_num: P17, peripheral: CSI, signal: csi_pixclk, pin_signal: GPIO_AD_12}
  - {pin_num: L12, peripheral: CSI, signal: csi_mclk, pin_signal: GPIO_AD_13}
  - {pin_num: N14, peripheral: CSI, signal: csi_vsync, pin_signal: GPIO_AD_14}
  - {pin_num: M14, peripheral: CSI, signal: csi_hsync, pin_signal: GPIO_AD_15, identifier: ''}
  - {pin_num: N17, peripheral: CSI, signal: 'csi_data, 09', pin_signal: GPIO_AD_16, identifier: ''}
  - {pin_num: N15, peripheral: CSI, signal: 'csi_data, 08', pin_signal: GPIO_AD_17}
  - {pin_num: M16, peripheral: CSI, signal: 'csi_data, 07', pin_signal: GPIO_AD_18}
  - {pin_num: L16, peripheral: CSI, signal: 'csi_data, 06', pin_signal: GPIO_AD_19}
  - {pin_num: K13, peripheral: CSI, signal: 'csi_data, 05', pin_signal: GPIO_AD_20}
  - {pin_num: K14, peripheral: CSI, signal: 'csi_data, 04', pin_signal: GPIO_AD_21, identifier: ''}
  - {pin_num: K12, peripheral: CSI, signal: 'csi_data, 03', pin_signal: GPIO_AD_22, identifier: ''}
  - {pin_num: J12, peripheral: CSI, signal: 'csi_data, 02', pin_signal: GPIO_AD_23, identifier: ''}
  - {pin_num: L9, peripheral: GPIO13, signal: 'gpio_io, 05', pin_signal: GPIO_SNVS_02, identifier: CAMERA_RST, direction: OUTPUT}
  - {pin_num: P16, peripheral: CSI, signal: 'csi_data, 10', pin_signal: GPIO_AD_11}
  - {pin_num: R17, peripheral: CSI, signal: 'csi_data, 11', pin_signal: GPIO_AD_10}
  - {pin_num: R16, peripheral: CSI, signal: 'csi_data, 12', pin_signal: GPIO_AD_09}
  - {pin_num: R15, peripheral: CSI, signal: 'csi_data, 13', pin_signal: GPIO_AD_08}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCsi3DCameraPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCsi3DCameraPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  /* GPIO configuration of BRIDGE_RESET on GPIO_EMC_B2_08 (pin P1) */
  gpio_pin_config_t BRIDGE_RESET_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_08 (pin P1) */
  GPIO_PinInit(GPIO2, 18U, &BRIDGE_RESET_config);

  /* GPIO configuration of VDD_1V2 on PMIC_STBY_REQ_DIG (pin T9) */
  gpio_pin_config_t VDD_1V2_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on PMIC_STBY_REQ_DIG (pin T9) */
  GPIO_PinInit(GPIO13, 2U, &VDD_1V2_config);

  /* GPIO configuration of CAMERA_RST on GPIO_SNVS_02_DIG (pin L9) */
  gpio_pin_config_t CAMERA_RST_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_02_DIG (pin L9) */
  GPIO_PinInit(GPIO13, 5U, &CAMERA_RST_config);

  /* GPIO configuration of CAMERA_PWR on GPIO_SNVS_06_DIG (pin M9) */
  gpio_pin_config_t CAMERA_PWR_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 1U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_06_DIG (pin M9) */
  GPIO_PinInit(GPIO13, 9U, &CAMERA_PWR_config);

  /* GPIO configuration of CAMERA_test on GPIO_SNVS_08_DIG (pin N9) */
  gpio_pin_config_t CAMERA_test_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_08_DIG (pin N9) */
  GPIO_PinInit(GPIO13, 11U, &CAMERA_test_config);

  /* GPIO configuration of AP_LDP_INT on GPIO_SNVS_09_DIG (pin R11) */
  gpio_pin_config_t AP_LDP_INT_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_SNVS_09_DIG (pin R11) */
  GPIO_PinInit(GPIO13, 12U, &AP_LDP_INT_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_08_VIDEO_MUX_CSI_DATA13,  /* GPIO_AD_08 is configured as VIDEO_MUX_CSI_DATA13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_09_VIDEO_MUX_CSI_DATA12,  /* GPIO_AD_09 is configured as VIDEO_MUX_CSI_DATA12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_10_VIDEO_MUX_CSI_DATA11,  /* GPIO_AD_10 is configured as VIDEO_MUX_CSI_DATA11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_11_VIDEO_MUX_CSI_DATA10,  /* GPIO_AD_11 is configured as VIDEO_MUX_CSI_DATA10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_12_VIDEO_MUX_CSI_PIXCLK,  /* GPIO_AD_12 is configured as VIDEO_MUX_CSI_PIXCLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_13_VIDEO_MUX_CSI_MCLK,   /* GPIO_AD_13 is configured as VIDEO_MUX_CSI_MCLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_14_VIDEO_MUX_CSI_VSYNC,  /* GPIO_AD_14 is configured as VIDEO_MUX_CSI_VSYNC */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_15_VIDEO_MUX_CSI_HSYNC,  /* GPIO_AD_15 is configured as VIDEO_MUX_CSI_HSYNC */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_16_VIDEO_MUX_CSI_DATA09,  /* GPIO_AD_16 is configured as VIDEO_MUX_CSI_DATA09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_17_VIDEO_MUX_CSI_DATA08,  /* GPIO_AD_17 is configured as VIDEO_MUX_CSI_DATA08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_18_VIDEO_MUX_CSI_DATA07,  /* GPIO_AD_18 is configured as VIDEO_MUX_CSI_DATA07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_19_VIDEO_MUX_CSI_DATA06,  /* GPIO_AD_19 is configured as VIDEO_MUX_CSI_DATA06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_20_VIDEO_MUX_CSI_DATA05,  /* GPIO_AD_20 is configured as VIDEO_MUX_CSI_DATA05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_21_VIDEO_MUX_CSI_DATA04,  /* GPIO_AD_21 is configured as VIDEO_MUX_CSI_DATA04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_22_VIDEO_MUX_CSI_DATA03,  /* GPIO_AD_22 is configured as VIDEO_MUX_CSI_DATA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_23_VIDEO_MUX_CSI_DATA02,  /* GPIO_AD_23 is configured as VIDEO_MUX_CSI_DATA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_08_GPIO_MUX2_IO18,   /* GPIO_EMC_B2_08 is configured as GPIO_MUX2_IO18 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR41 = ((IOMUXC_GPR->GPR41 &
    (~(IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH(0x00U) /* GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
    );
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_06_LPI2C6_SDA,         /* GPIO_LPSR_06 is configured as LPI2C6_SDA */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_06 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_07_LPI2C6_SCL,         /* GPIO_LPSR_07 is configured as LPI2C6_SCL */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_07 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_02_DIG_GPIO13_IO05,    /* GPIO_SNVS_02_DIG is configured as GPIO13_IO05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_06_DIG_GPIO13_IO09,    /* GPIO_SNVS_06_DIG is configured as GPIO13_IO09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_08_DIG_GPIO13_IO11,    /* GPIO_SNVS_08_DIG is configured as GPIO13_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_SNVS_09_DIG_GPIO13_IO12,    /* GPIO_SNVS_09_DIG is configured as GPIO13_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_PMIC_STBY_REQ_DIG_GPIO13_IO02,   /* PMIC_STBY_REQ_DIG is configured as GPIO13_IO02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_08_GPIO_MUX2_IO18,   /* GPIO_EMC_B2_08 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pullup resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_06_LPI2C6_SDA,         /* GPIO_LPSR_06 PAD functional properties : */
      0x2EU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain LPSR Field: Enabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_07_LPI2C6_SCL,         /* GPIO_LPSR_07 PAD functional properties : */
      0x2EU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain LPSR Field: Enabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}


